pulp-bio/wulpus-pro/fw/esp32/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

CONFIG_BSP_LED_PIN=8

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=20
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=40
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=128
CONFIG_ESP32_WIFI_RX_BA_WIN=32
CONFIG_ESP32_WIFI_TX_BA_WIN=64

CONFIG_LWIP_TCP_SND_BUF_DEFAULT=40000
CONFIG_LWIP_TCP_WND_DEFAULT=40000
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16